blog/20231208-1750.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/blog/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/blog">
<title>git-annex resolves the issue of org and binary file separation</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org">Home</a><a href="https://www.p-snow.org/config/blog/tag-english.html">Posts</a><a href="https://www.p-snow.org/config/blog/tag-japanese.html">日本語記事</a><a href="https://www.p-snow.org/config/blog/about.html">About</a><a href="https://www.p-snow.org/config/blog/rss.xml">RSS</a></nav><h1>.dot life</h1><p>by p-snow</p></header></div>
<div id="content">
<div class="post-date">08 Dec 2023</div><h1 class="post-title"><a href="https://www.p-snow.org/config/blog/20231208-1750.html">git-annex resolves the issue of org and binary file separation</a></h1>
<p>
<preview>
If you are an avid Org Mode user and a life logger like me, chances are you have your Org files stored in a Git repository. Even if you manage to represent your life in textual data, there are often cases where you should or need to utilize a more eloquent data format. Notifications from the municipality are often in PDF format, memories of your family members are typically stored as JPEG or MKV files, and the program on which your research relies is an EXE file. It is impractical to include these binary files in your Git repository. But how do we manage them in conjunction with Org files? This is where <a href="https://git-annex.branchable.com/">git-annex</a> comes to the rescue.
</preview>
</p>

<p>
Similar to <a href="https://git-lfs.com/">Git LFS</a>, git-annex is designed to deal with binary data in Git repository. With git-annex, your existing Git repository can handle binary data in addition to managing text data in a familiar way. With your upgraded binary-ready Git repository, you can use hyperlinks or <a href="https://orgmode.org/manual/Attachments.html">org-attach</a> in Org files where both the referrer (org) and the referent (binary) are in the same hierarchy.
</p>

<p>
Since binary files tend to increase in size, some Git repository instances may not have enough space to store all the binary files themselves. git-annex can address this issue by managing the number of copies for each binary file. For example, the Git repository on the NAS at home contains copies of all binary files, while the one in cloud storage only includes the smaller, more significant files. git-annex implements this feature by utilizing Un*x symlink mechanism. git-annex also offers a wide range of functionalities. You can explore some of them by following this <a href="https://git-annex.branchable.com/walkthrough/">walkthrough</a>.
</p>

<p>
Our esteemed editor, Emacs, has a reliable package for managing git-annex within Emacs. The package's name is quite straightforward: "<a href="https://github.com/jwiegley/git-annex-el">git-annex</a>". With this package, you can easily manage annexed files in Dired, making it extremely user-friendly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">use-package</span> git-annex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:after</span> dired)
</pre>
</div>

<p>
If you are facing difficulties in finding a suitable place for your valuable yet large binary files, give git-annex a try!
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/blog/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/blog/tag-english.html">english</a> <a href="https://www.p-snow.org/config/blog/tag-org.html">org</a> <a href="https://www.p-snow.org/config/blog/tag-git.html">git</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
